Docs/Reference/Content/images/dependencies/net10.0/d2/alloverit-entityframeworkcore-diagrams.d2
direction: left

aoi: AllOverIt
aoi.alloverit-entityframeworkcore-diagrams: AllOverIt.EntityFrameworkCore.Diagrams
microsoft-entityframeworkcore-relational_10-0-9: Microsoft.EntityFrameworkCore.Relational\nv10.0.9
microsoft-entityframeworkcore_10-0-9: Microsoft.EntityFrameworkCore\nv10.0.9
microsoft-extensions-caching-memory_10-0-9: Microsoft.Extensions.Caching.Memory\nv10.0.9
microsoft-extensions-configuration-abstractions_10-0-9: Microsoft.Extensions.Configuration.Abstractions\nv10.0.9
microsoft-extensions-logging_10-0-9: Microsoft.Extensions.Logging\nv10.0.9
aoi.alloverit: AllOverIt
aoi.alloverit-assertion: AllOverIt.Assertion
microsoft-entityframeworkcore-relational_10-0-9 <- aoi.alloverit-entityframeworkcore-diagrams
microsoft-entityframeworkcore_10-0-9 <- microsoft-entityframeworkcore-relational_10-0-9
microsoft-extensions-caching-memory_10-0-9 <- microsoft-entityframeworkcore-relational_10-0-9
microsoft-extensions-configuration-abstractions_10-0-9 <- microsoft-entityframeworkcore-relational_10-0-9
microsoft-extensions-logging_10-0-9 <- microsoft-entityframeworkcore-relational_10-0-9
aoi.alloverit <- aoi.alloverit-entityframeworkcore-diagrams
aoi.alloverit-assertion <- aoi.alloverit
microsoft-entityframeworkcore-relational_10-0-9.style.fill: "#ADD8E6"
microsoft-entityframeworkcore-relational_10-0-9.style.opacity: 0.8
microsoft-entityframeworkcore_10-0-9.style.fill: "#FFEC96"
microsoft-entityframeworkcore_10-0-9.style.opacity: 0.8
microsoft-extensions-caching-memory_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-caching-memory_10-0-9.style.opacity: 0.8
microsoft-extensions-configuration-abstractions_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-configuration-abstractions_10-0-9.style.opacity: 0.8
microsoft-extensions-logging_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-logging_10-0-9.style.opacity: 0.8
aoi.style.fill: "#E7EBFC"
aoi.style.opacity: 1
